/**
 * @file main.c
 * @brief Файл з реалізацією і викликом функції.
 *
 * @author Babenko A.
 * @date 29-nov-2020
 * @version 1.0
 */

/**
 * Перевірка на "щасливий квиток"
 * 
 * Функція визначає чи є ціле 6-значне число "щасливим" квитком 
 *	@param num число яке буде перевірятись на "щасливість"
 *  @return Результат роботи функції (res) 
 */
int isLucky(int);

/**
 * Головна функція
 * 
 * Послідовність дій:
 * - виклик функції isLucky
 * @return успішний код виконання програми (0)
 */
int main()
{    
    printf("%d\n", isLucky(102300));
	return 0;
}

int isLucky(int n) {
    /* Объявляем переменные */
    int x1 = 0, x2 = 0, i = 0;
    int res;

    /* Вычисляем сумму последних 3х цифр */
    for(i=0; i<3; i++)
    {
        x2 += n % 10; 
        n /= 10;
    }
    /* Вычисляем сумму первых 3х цифр */
    for(i=0; i<3; i++)
    {
        x1 += n % 10;
        n /= 10;
    }

/*
    while (i<3)
    {
        x2 += n % 10; 
        n /= 10;
        i++;
    }
    i = 0;
    while (i<3)
    {
        x1 += n % 10; 
        n /= 10;
        i++;
    }
*/
  
/*
    do
    {
        x2 += n % 10; 
        n /= 10;
        i++;
    } while (i<3);
    i = 0;
    do
    {
        x1 += n % 10; 
        n /= 10;
        i++;
    } while (i<3);
*/

    if (x1 == x2)
    {
        res = 1;
    } else
    {
        res = 0;
    }
    return res;
}