/**
 * @file main.c
 * @brief Файл з реалізацією і викликом функції.
 *
 * @author Babenko A.
 * @date 29-nov-2020
 * @version 1.0
 */

#include <stdarg.h>

/**
 * Розрахунок кількісті пар n-1 < n
 * 
 * Функція знаходить та повертає кількість пар чисел у котрих попереднє число менше за наступне. Передається варіативна кількість чисел
 *	@param nums Кількість чисел
 *	@param count Результат роботи функції
 * @return повернення результату роботи функції (count)
 */
int func(int, ...);

/**
 * Головна функція
 * 
 * Послідовність дій:
 * - виклик функції func
 * @return успішний код виконання програми (0)
 */
int main()
{
    func(5, 6, 5, 4, 5, 6); /* Виклик функции */
    return 0;
}

int func(int nums, ...)
{
    int count = 0; 
    int arr[nums]; 
    va_list args;  /* Початок роботи з варіативним списком аргументів */
    va_start(args, nums); 
    /* Запис варіативних чисел, переданих у функцію до масиву */
    for (int i = 0; i < nums; i++) { 
        arr[i] = va_arg(args, int); 
    }
    /* Послідовне порівняння попереднього і наступного числа масиву */
    for (int i = 0; i < nums; i++) {
        if (arr[i] < arr[i+1]) {
            count++;
        }
    }
    va_end(args);   /* Кінець роботи з варіативним списком аргументів */
    return count;
}

