#ifndef _BABENKO_15_
#define _BABENKO_15_

/**
 * @file lib.h
 * @brief Файл з описом структури файлу, перерахуванням доступів файлу та функцій
 * оперування ними
 *
 * @author Babenko A.
 * @date 20-feb-2020
 * @version 1.0
 */

#include <string.h>
#include <stdio.h>
#include <stdbool.h>

/**
 * Структура «Доступи»
 */
struct permission
{
    bool read;
    bool write;
    bool execute;
};

/**
 * Структура «Файл»
 */
typedef struct
{
    bool isVisible;
    char *filename[20];
    float size;
    struct permission access;
    char *extension[4];
} file;

/**
 * Підрахування кількості строк.
 *
 * Функція рахує кількість строк у переданому файлі.
 * @param filename назва файлу
 * @return кількість строк у файлі
 */
int count_lines(char *filename);

/**
 * Переведення строки до булевого типу
 *
 * Функція переводить передану строку в булевий тип даних
 * @param str строка для переводу
 * @return значення true або false
 */
bool bool_input(char *str);

/**
 * Переведення булевого типу в строку
 *
 * Функція переводить переданий булевий тип даних в строку
 * @param b булевий тип даних для переводу
 * @return строку "true" або "false"
 */
char * bool_output(bool b);

/**
 * Читання з файлу масиву структур з даними про файли.
 *
 * Функція у циклі читає дані з файлу про кожний елемент масиву
 * @param arr масив з даними про файли, які необхідно прочитати
 * @param N кількість файлів у переданому масиві
 * @param filename назва файлу, з якого треба прочитати
 */
void read_from_file(file *arr, int N, char *filename);

/**
 * Запис в файл масиву структур з даними про файли.
 *
 * Функція у циклі записуж дані в файл про кожний елемент масиву
 * @param buff назва файлу, в який треба записати
 * @param arr масив з даними про файли, які необхідно прочитати
 * @param N кількість файлів у переданому масиві
 */
void write_to_file(char *buff, file *arr, int N);

/**
 * Вивід до екрану вмісту масиву з даними про файли.
 *
 * Функція у циклі виводить дані на екран про кожний елемент масиву
 * з даними про файл у наступному форматі:
 * "Параметр: значення"
 * @param arr масив з даними про файли, які необхідно вивести на екран
 * @param N кількість файлів у переданому масиві
 */
void output(file *arr, int N);

/**
 * Сортування за переданим критерієм
 *
 * Функція сортує масив структур за переданим критерієм
 * @param arr масив з даними про файли
 * @param N кількість файлів у переданому масиві
 * @param criterion критерій для сортування
 */
void sort_by_criterion(file *arr, int N, int criterion);

/**
 * Перестановка структур місцями
 *
 * Функція переставляє елемент структури місцями з наступним
 * @param arr масив з даними про файли
 * @param N кількість файлів у переданому масиві
 * @param criterion елемент котрий буде переставлений з наступним
 */
void sorting(file *arr, int N, int j) ;

/**
 * Обирає файли > переданої кількості кілобайт
 *
 * Функція обирає файли розмір котрих більне ніж передана кількість кілобайт
 * @param arr масив з даними про файли
 * @param N кількість файлів у переданому масиві
 * @param numberOfKilobytes передана кількість кілобайт
 * @return кількість файлів розмір яких більший за передану кількість кілобайт
 */
int pick_by_size(file *arr, int N, int numberOfKilobytes);

/**
 * Генерація псевдовипадкових чисел
 *
 * Функція генерує псевдовипадкове число
 * @return псевдовипадкове число типу int
 */
int random();

/**
 * Генерація псевдовипадкових чисел
 *
 * Функція генерує псевдовипадкове число
 * @return псевдовипадкове число типу float
 */
float random_float();

/**
 * Генерація псевдовипадкових чисел
 *
 * Функція генерує псевдовипадкове булеве значення
 * @return псевдовипадкове булеве значення
 */
bool random_bool();

/**
 * Створення даних про тварину.
 *
 * Функція генерує та повертає масив файлів з випадковими значеннями його полів
 * @param arr структура {@link file} для заповнення
 */
void generation(file *arr, int N);

/**
 * Запис в файл масиву структур з даними про файли в бінарному форматі.
 *
 * Функція у циклі записуж дані в файл про кожний елемент масиву в бінарному форматі.
 * @param buff назва файлу, в який треба записати
 * @param arr масив з даними про файли, які необхідно записати
 * @param N кількість файлів у переданому масиві
 */
void write_to_file_bin(char *buff, file *arr, int N);

/**
 * Читання з файлу масиву структур з даними про файли в бінарному форматі.
 *
 * Функція у циклі читає дані з файлу про кожний елемент масиву в бінарному форматі.
 * @param buff назва файлу, з якого треба прочитати
 * @param arr масив з даними про файли, які необхідно прочитати
 * @param N кількість файлів у переданому масиві
 */
void read_from_file_bin(char *buff, file *arr, int N);

/**
 * Пошук структури заданої користувачем.
 *
 * Функція знаходить потрібну страктуру у бінарному файлі.
 * @param buff назва файлу, з якого треба прочитати
 * @param arr масив з даними про файли, які необхідно прочитати
 * @param N кількість файлів у переданому масиві
 * @param number структура для пошуку
 */
void find_struct(char *buff, file *arr, int N, int number);

#endif